experimental_cases/study_scripts/base_case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

12
(
    outlet
    {
        type            patch;
        nFaces          1288;
        startFace       339020;
    }
    impeller
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2336;
        startFace       340308;
    }
    vessel
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          8596;
        startFace       342644;
    }
    shaft
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1560;
        startFace       351240;
    }
    inlet
    {
        type            patch;
        nFaces          84;
        startFace       352800;
    }
    nonCouple1
    {
        type            patch;
        inGroups        List<word> 1(nonCouple);
        nFaces          5848;
        startFace       352884;
    }
    nonCouple2
    {
        type            patch;
        inGroups        List<word> 1(nonCouple);
        nFaces          5848;
        startFace       358732;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 
2
(
wall
walls
)
;
        nFaces          3168;
        startFace       364580;
    }
    nonConformalCyclic_on_nonCouple1
    {
        type            nonConformalCyclic;
        inGroups        List<word> 1(nonConformalCyclic);
        nFaces          0;
        startFace       367748;
        matchTolerance  0.0001;
        neighbourPatch  nonConformalCyclic_on_nonCouple2;
        transformType   none;
        originalPatch   nonCouple1;
    }
    nonConformalCyclic_on_nonCouple2
    {
        type            nonConformalCyclic;
        inGroups        List<word> 1(nonConformalCyclic);
        nFaces          0;
        startFace       367748;
        matchTolerance  0.0001;
        neighbourPatch  nonConformalCyclic_on_nonCouple1;
        transformType   none;
        originalPatch   nonCouple2;
    }
    nonConformalError_on_nonCouple1
    {
        type            nonConformalError;
        inGroups        List<word> 1(nonConformalError);
        nFaces          0;
        startFace       367748;
        originalPatch   nonCouple1;
    }
    nonConformalError_on_nonCouple2
    {
        type            nonConformalError;
        inGroups        List<word> 1(nonConformalError);
        nFaces          0;
        startFace       367748;
        originalPatch   nonCouple2;
    }
)

// ************************************************************************* //
