experimental_cases/study_scripts/base_case/constant/fvMesh/polyFaces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       surfaceLabelField;
    location    "constant/fvMesh";
    object      polyFaces;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform -1;

boundaryField
{
    outlet
    {
        type            polyFaces;
    }
    impeller
    {
        type            polyFaces;
    }
    vessel
    {
        type            polyFaces;
    }
    shaft
    {
        type            polyFaces;
    }
    inlet
    {
        type            polyFaces;
    }
    nonCouple1
    {
        type            polyFaces;
    }
    nonCouple2
    {
        type            polyFaces;
    }
    walls
    {
        type            polyFaces;
    }
    nonConformalCyclic_on_nonCouple1
    {
        type            nonConformalPolyFaces;
        patchType       nonConformalCyclic;
        size            5971;
        value           nonuniform List<label> 
5971
(
352884
352885
352886
352886
352887
352888
352889
352890
...
)
;
    }
    nonConformalCyclic_on_nonCouple2
    {
        type            nonConformalPolyFaces;
        patchType       nonConformalCyclic;
        size            5971;
        value           nonuniform List<label> 
5971
(
358732
358733
358734
360771
358735
358736
358737
358738
...
)
;
    }
    nonConformalError_on_nonCouple1
    {
        type            nonConformalPolyFaces;
        patchType       nonConformalError;
        size            0;
        value           nonuniform List<label> 0();
    }
    nonConformalError_on_nonCouple2
    {
        type            nonConformalPolyFaces;
        patchType       nonConformalError;
        size            0;
        value           nonuniform List<label> 0();
    }
}


// ************************************************************************* //
