experimental_cases/study_scripts/base_case/system/createZonesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createZonesDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
inlet
{

    type        annulus;
    zoneType    face;

    point1 (0 -1 0);
    point2 (0 -0.159 0);
    outerRadius 0.13;
    innerRadius 0.12;
}

baffles
{
    type union;
    
    baffle1
    {
        type        surface;

        surface     plate;
        origin      (0.14 -10 0);
        span        (10 20 0);
    };
    baffle2
    {
        type        surface;

        surface     plate;
        origin      (-2 -10 0);
        span        (1.86 20 0);
    };
    baffle3
    {
        type        surface;

        surface     plate;
        origin      (0 -10 0.14);
        span        (0 20 10);
    };
    baffle4
    {
        type        surface;

        surface     plate;
        origin      (0 -10 -2);
        span        (0 20  1.86);
    };
}


// ************************************************************************* //
